packages/oftest/oftest-0.1.2.tar.gz/oftest-0.1.2/testsuite/test_damBreak4/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir

runApplication blockMesh
runApplication decomposePar
runParallel setFields

runParallel $(getApplication)

#------------------------------------------------------------------------------
